
&НаКлиенте
Процедура Генерировать(Команда)
	ГенерироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьКэшОбъектов()
	
	КэшОбъектов	= Новый Соответствие;
	ЗаполнитьИзСправочника(КэшОбъектов, Метаданные.Справочники.Города);
	ЗаполнитьИзСправочника(КэшОбъектов, Метаданные.Справочники.Товар);
	ЗаполнитьИзСправочника(КэшОбъектов, Метаданные.Справочники.Продавцы);
	
	Возврат КэшОбъектов;
	
КонецФункции

&НаСервере
Процедура ГенерироватьНаСервере()
	
	КэшОбъектов = ПолучитьКэшОбъектов();
	Гсч = Новый ГенераторСлучайныхЧисел();
	ИмяГорода = "Город";
	ШагВремени = (ДатаОкончания - ДатаНачала)/КоличествоДокументов;
	
	Для счДокументов = 1 По КоличествоДокументов Цикл
		ДатаДокумента = ДатаНачала + счДокументов * ШагВремени;
		
		Документ = Документы.Продажи.СоздатьДокумент();
		Документ.Дата = ДатаДокумента;
		Город = ПолучитьЗначениеИзКоллекции(Гсч, ИмяГорода, КэшОбъектов);		
		Продавец = ПолучитьЗначениеИзКоллекции(Гсч, "Продавец", КэшОбъектов);
		Документ.Город = Город;
		Документ.Продавец = Продавец;
		Для счСтрок = 1 По КоличествоСтрокВДокументе Цикл
			
			Новая = Документ.Состав.Добавить();
			Товар = ПолучитьЗначениеИзКоллекции(Гсч, "Товар", КэшОбъектов);					
			
			Новая.Товар = Товар;
			Новая.Количество = гсч.СлучайноеЧисло(1, 50);
			Новая.Сумма = гсч.СлучайноеЧисло(1, 10000000)/10000;
		КонецЦикла;
		Документ.Состав.Свернуть("Товар", "Количество, Сумма");
		Для каждого строкаТЧ Из Документ.Состав Цикл
			СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
		КонецЦикла;
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеИзКоллекции(Гсч, Знач ИмяТаблицы, КэшОбъектов)
	
	Возврат КэшОбъектов [ИмяТаблицы] [Гсч.СлучайноеЧисло(0, КэшОбъектов [ИмяТаблицы].КОличество()-1)].Ссылка;

КонецФункции

&НаСервере
Функция ЗаполнитьИзСправочника(КэшОбъектов, Менеджер)
	
	ИмяСправочника = Менеджер.Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ
		|	Спр.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.%1 КАК Спр", ИмяСправочника);
	
	РезультатЗапроса = Запрос.Выполнить();
	КэшОбъектов.Вставить(ИмяСправочника, РезультатЗапроса.Выгрузить());

КонецФункции
