
#Область ПрограммныйИнтерфейс
 
Процедура ПодготовитьОкружение() Экспорт
	
	НЗ = РегистрыСведений.мзРезультаты.СоздатьНаборЗаписей();
	НЗ.Записать();

	СправочникПометитьНаУдаление("мрСортированныеДанные");
	СправочникПометитьНаУдаление("мрРезультатРаботыШагаМАП");
	
	СчетчикБлоков = 0;
	СчетчикБлоковСорт = 0;	
	
КонецПроцедуры

Процедура Map(Параметры) Экспорт 
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Регистратор", Новый ОписаниеТипов("ДокументСсылка.Продажи"));
	ТаблицаДанных.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для каждого Элемент Из Параметры.Данные Цикл
		СтрокаДанных = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, Элемент);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Регистратор КАК Регистратор,
		|	ТаблицаДанных.Сумма КАК Сумма,
		|	ТаблицаДанных.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Сумма КАК Сумма,
		|	Продажи.Продавец КАК Продавец,
		|	ВТ_Данные.Количество КАК Количество
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Продажи КАК Продажи
		|		ПО ВТ_Данные.Регистратор = Продажи.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	РезультатЗапроса = Запрос.Выполнить();
	                      
	Выборка = РезультатЗапроса.Выбрать();
	ВыходныеДанные = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Результат = Справочники.мрРезультатРаботыШагаМАП.СоздатьЭлемент();		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Результат.Ключ = Выборка.Продавец;
		Результат.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура Shuffle(Параметры = Неопределено) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мрРезультатРаботыШагаМАП.Ключ КАК Ключ,
		|	мрРезультатРаботыШагаМАП.Сумма КАК Сумма,
		|	мрРезультатРаботыШагаМАП.Количество КАК Количество
		|ИЗ
		|	Справочник.мрРезультатРаботыШагаМАП КАК мрРезультатРаботыШагаМАП
		|ГДЕ
		|	НЕ мрРезультатРаботыШагаМАП.ПометкаУдаления
		|ИТОГИ ПО
		|	Ключ";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаКлюч = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКлюч.Следующий() Цикл
		
		КлючДанных = Справочники.мрСортированныеДанные.СоздатьЭлемент();
		КлючДанных.Ключ = ВыборкаКлюч.Ключ;
	
		ВыборкаДетальныеЗаписи = ВыборкаКлюч.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = КлючДанных.Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		КлючДанных.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

Процедура Reduce(Параметры) Экспорт 
	
	ОбщаяСумма = 0;
	ОбщееКоличество = 0;
	
	Для каждого Значение Из Параметры.Данные Цикл

		ОбщаяСумма = ОбщаяСумма + Значение.Сумма;
		ОбщееКоличество = ОбщееКоличество + Значение.Количество;
	КонецЦикла;
	
	ОбщееКоличество = ?(ОбщееКоличество = 0, 1, ОбщееКоличество);
	Среднее = ОбщаяСумма / ОбщееКоличество;
	
	МЗ = РегистрыСведений.мзРезультаты.СоздатьМенеджерЗаписи();
	МЗ.Ключ = Параметры.Ключ;
	МЗ.Результат1 = Среднее;
	МЗ.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ПолучитьРезультатЭтапаМап()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мрРезультатРаботыШагаМАП.Ключ КАК Ключ,
		|	мрРезультатРаботыШагаМАП.Сумма КАК Сумма,
		|	мрРезультатРаботыШагаМАП.Количество КАК Количество
		|ИЗ
		|	Справочник.мрРезультатРаботыШагаМАП КАК мрРезультатРаботыШагаМАП
		|ГДЕ
		|	НЕ мрРезультатРаботыШагаМАП.ПометкаУдаления
		|ИТОГИ ПО
		|	Ключ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;

КонецФункции

Процедура СправочникПометитьНаУдаление(Имя)
		
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ
	|	СПР.Ссылка
	|ИЗ
	|	Справочник.%1 КАК СПР
	|ГДЕ
	|	НЕ СПР.ПометкаУдаления";
	
	Запрос.Текст = СтрШаблон(Текст, Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;

КонецПроцедуры


#КонецОбласти
