#Область ПрограммныйИнтерфейс


//Точка входа в процесс расчета
//	Параметры: 
//	МенеджерДанных - объект - объект с экспортным методом получения блока данных 
//		ПолучитьСледующийБлокДанных(БлокДанных), который при успешном получении данных возвращает ИСТИНА
//		Данные возвращаются в фактическом параметре "БлокДанных"
//	ИмяМетодаMap, ИмяМетодаShuffle, ИмяМетодаReduce - Строка - имена экспортных методов соот-их функций общего модуля
Процедура ЗапуститьПроцессMapReduce(ПараметрыЗадания) Экспорт
	
	мзЗадания.ДобавитьЗадание("MapReduce.МастерПроцесс", ПараметрыЗадания);
	
КонецПроцедуры

Процедура МастерПроцесс(ПараметрыЗадания) Экспорт
	
	Менеджер = Обработки[ПараметрыЗадания.Менеджер];
	МенеджерДанных = Менеджер.Создать();
	Менеджер.ПодготовитьОкружение();
	
	ЗаполнитьЗначенияСвойств(МенеджерДанных, ПараметрыЗадания.Параметры);
	// Шаг MAP()
	ИмяМетодаMap = СтрШаблон("Обработки.%1.Map", ПараметрыЗадания.Менеджер);
	МассивЗаданийMAP = Новый Массив;
	БлокДанных = Неопределено;
	
	Пока МенеджерДанных.ПолучитьСледующийБлокДанных(БлокДанных) Цикл
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Данные", БлокДанных);
		КлючЗадания = мзЗадания.ДобавитьЗадание(ИмяМетодаMap, ПараметрыЗадания);
		МассивЗаданийMAP.Добавить(КлючЗадания);
	КонецЦикла;
	
	// Ожидание завершения заданий MAP
	Минута = 60;
	МинутОжидания = 30;
	ДождалисьВыполнения = Ложь;
	
	Пока НЕ ДождалисьВыполнения И МинутОжидания > 0 Цикл
		ДождалисьВыполнения = мзЗадания.ДождатьсяВыполнения(МассивЗаданийMAP, Минута);
		МинутОжидания = МинутОжидания - 1;
	КонецЦикла;
	
	Если НЕ ДождалисьВыполнения Тогда
		Для каждого КлючьЗадания Из МассивЗаданийMAP Цикл
			мзЗадания.ОтменитьЗадание(КлючьЗадания);			
		КонецЦикла;
		//TODO что делать еще если не дождались завершения заданий
		Возврат;
	КонецЕсли;
	
	Менеджер.Shuffle();
	
	// Шаг REDUCE
	ИмяМетодаReduce = СтрШаблон("Обработки.%1.Reduce", ПараметрыЗадания.Менеджер);
	МассивЗаданийReduce = Новый Массив;
	БлокДанных = Неопределено;
	
	Пока МенеджерДанных.ПолучитьСледующийБлокСортированныхДанных(БлокДанных) Цикл
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Данные", БлокДанных);
		КлючЗадания = мзЗадания.ДобавитьЗадание(ИмяМетодаReduce, ПараметрыЗадания);
		МассивЗаданийReduce.Добавить(КлючЗадания);
	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти

#Область Служебные
 
#КонецОбласти